ankrysm/esp32_ws2812/main/create_events.c
		if ( iH<0 || iH >360 || iS<0 || iS >100|| iV<0 || iV>100) {
			snprintf(errmsg, sz_errmsg, "attr '%s': '%s' is not a valid HSV", attr, sval);
			rc = ESP_FAIL;
		} else {
			hsv->h = iH;
			hsv->s = iS;
			hsv->v = iV;
			snprintf(errmsg, sz_errmsg, "'hsv': attr '%s': hsv=%d,%d,%d", attr, hsv->h, hsv->s, hsv->v );
		}

	} else {
		snprintf(errmsg, sz_errmsg, "attr '%s': access failed: %s", attr, l_errmsg);
	}
	return rc;
}

/**
 * gets an RGB color definition as HSV
 */
static t_result decode_json_getcolor_as_rgb(cJSON *element, char *attr, T_COLOR_HSV *hsv, char *errmsg, size_t sz_errmsg) {
	char sval[32];
	char l_errmsg[64];

	if ( !attr || !strlen(attr))
		return ESP_ERR_NOT_FOUND;

	t_result rc = evt_get_string(element, attr, sval, sizeof(sval), l_errmsg, sizeof(l_errmsg));

	if ( rc == RES_OK) {
		char *s=strdup(sval), *sR=NULL, *sG=NULL, *sB=NULL, *l;
		int32_t iR=-1, iG=-1, iB=-1;
		sR=strtok_r(s, ",", &l);
		if (sR) {
			iR=atoi(sR);
			sG=strtok_r(NULL, ",", &l);
		}
		if (sG) {
			iG = atoi(sG);
			sB=strtok_r(NULL, ",", &l);
		}
		if (sB) {
			iB=atoi(sB);
		}
		free(s);

		if ( iR<0 || iR > 255 || iG<0 || iG >255|| iB<0 || iB>255) {
			snprintf(errmsg, sz_errmsg, "attr '%s': '%s' is not a valid RGB", attr, sval);
			rc = ESP_FAIL;
		} else {
			T_COLOR_RGB rgb={.r=iR, .g=iG, .b=iB};
			c_rgb2hsv(&rgb,hsv);
			snprintf(errmsg, sz_errmsg, "'rgb': attr '%s': rgb=%s hsv=%d,%d,%d", attr, sval, hsv->h, hsv->s, hsv->v );
		}
	} else {
		snprintf(errmsg, sz_errmsg, "attr '%s': access failed: %s", attr, l_errmsg);
	}
	return rc;
}

/**
 * tries different methods to get a color
 */
static esp_err_t decode_json_getcolor(cJSON *element, char *attr4colorname, char *attr4hsv, char *attr4rgb, T_COLOR_HSV *hsv, char *errmsg, size_t sz_errmsg) {
	esp_err_t rc;
	rc = decode_json_getcolor_by_name(element, attr4colorname, hsv, errmsg, sz_errmsg);
	if (rc != ESP_ERR_NOT_FOUND)
		return rc;

	rc = decode_json_getcolor_as_hsv(element, attr4hsv, hsv, errmsg, sz_errmsg);
	if (rc != ESP_ERR_NOT_FOUND)
		return rc;

	rc = decode_json_getcolor_as_rgb(element, attr4rgb, hsv, errmsg, sz_errmsg);

	return rc;
}

/**
 * reads a single T_EVT_TIME element
 */
static esp_err_t decode_json4event_evt_time(cJSON *element, uint32_t id, T_EVENT *evt, t_processing_type processing_type, char *errmsg, size_t sz_errmsg) {
	esp_err_t rc = ESP_FAIL;

	T_EVT_TIME *t = NULL;

	char *attr;
	double val;
//	bool bval;
	char sval[64];
	char hint[32]; // for logging

	do {
		switch ( processing_type) {
		case PT_INIT:
			snprintf(hint, sizeof(hint),"%s", "INIT");
			t = create_timing_event_init(evt,id);
			break;
		case PT_WORK:
			snprintf(hint, sizeof(hint),"%s", "WORK");
			t = create_timing_event(evt, id);
			break;
		case PT_FINAL:
			snprintf(hint, sizeof(hint),"%s", "FINAL");
			t = create_timing_event_final(evt, id);
			break;
		}
		if ( !t ) {
			snprintf(errmsg, sz_errmsg,"%s/%s/%d: could not create event data", hint, evt->oid, id);
			break;

		}
		ESP_LOGI(__func__, "%s/%s/%d: 'time event' created", hint, evt->oid, id);

		attr="type";
		if (evt_get_string(element, attr, sval, sizeof(sval), errmsg, sz_errmsg) != RES_OK)
			break;
		t->type = TEXT2ET(sval);
		if ( t->type == ET_UNKNOWN) {
			snprintf(errmsg, sz_errmsg,"%s/%s/%d: attr='%s' '%s' unknown", hint, evt->oid, id, attr, sval);
			break;
		}

		attr="time"; // optional default 0
		t->time = 0;
		if (evt_get_number(element, attr, &val, errmsg, sz_errmsg) == ESP_OK) {
			t->time = val;
			ESP_LOGI(__func__, "tid=%d: %s=%llu", id, attr, t->time);
		}

		attr="marker"; // optional, for jump to
		if (evt_get_string(element, attr, sval, sizeof(sval), errmsg, sz_errmsg) == RES_OK) {
			strlcpy(t->marker, sval,LEN_EVT_MARKER );
			ESP_LOGI(__func__, "%s/%s/%d: %s='%s'", hint, evt->oid, id, attr, t->marker);
		}

//		attr="init";
//		if (evt_get_bool(element, attr, &bval, errmsg, sz_errmsg) == ESP_OK) {
//			if ( bval) {
//				t->status |= TE_FOR_INIT; // start with wait
//			}
//			ESP_LOGI(__func__, "id=%d: %s=%s", id, attr, (bval?"TRUE":"FALSE"));
//		}
//		ESP_LOGI(__func__, "id=%d: status=0x%04x", id, t->status);


		//		attr="oid"; // optional
//		if (evt_get_string(element, attr, sval, sizeof(sval), errmsg, sz_errmsg) == RES_OK) {
//			strlcpy(t->oid, sval,LEN_EVT_MARKER );
//			ESP_LOGI(__func__, "tid=%d: %s='%s'", id, attr, t->oid);
//		}
		/*
		attr="set_flags";
		if (evt_get_string(element, attr, sval, sizeof(sval), errmsg, sz_errmsg) == ESP_OK) {
			t->set_flags = TEXT2EVFL(sval);
			if ( t->set_flags == EVFL_UNKNOWN) {
				snprintf(errmsg, sz_errmsg,"tid=%d: attr='%s' '%s' unknown", id, attr, sval);
				break;
			}
		}

		attr="clear_flags";
		if (evt_get_string(element, attr, sval, sizeof(sval), errmsg, sz_errmsg) == ESP_OK) {
			t->clear_flags = TEXT2EVFL(sval);
			if ( t->clear_flags == EVFL_UNKNOWN) {
				snprintf(errmsg, sz_errmsg,"tid=%d: attr='%s' '%s' unknown", id, attr, sval);
				break;
			}
		}
	    */
		attr="value"; // may be number or string
		if (evt_get_number(element, attr, &val, errmsg, sz_errmsg) == RES_OK) {
			t->value = val;
			ESP_LOGI(__func__, "%s/%s/%d: %s=%.3f",hint, evt->oid,  id, attr, t->value);
			switch(t->type) {
			case ET_SET_REPEAT_COUNT:
				switch ( processing_type ) {
				case PT_INIT:
					evt->evt_time_list_repeats = t->value;
					ESP_LOGI(__func__, "%s/%s/%d: repeats -> %d", hint, evt->oid, id, attr, evt->evt_time_list_repeats);
					break;
				default:
					snprintf(errmsg, sz_errmsg,"%s only in 'init' section", ET2TEXT(t->type));
				}
				break;

			default:
				break;
			}
		} else if (evt_get_string(element, attr, sval, sizeof(sval), errmsg, sz_errmsg) == RES_OK) {
			strlcpy(t->svalue, sval,sizeof(t->svalue));
			ESP_LOGI(__func__, "%s/%s/%d: %s='%s'", hint, evt->oid, id, attr, t->svalue);
		}



		rc = ESP_OK;
	} while(0);

	if ( rc == ESP_OK) {
		snprintf(errmsg, sz_errmsg,"wid=%d: 'time event' created", id);
		ESP_LOGI(__func__,"%s", errmsg);
	} else {
		ESP_LOGE(__func__, "error: %s", errmsg);
	}

	return rc;
}

static esp_err_t decode_json4event_evt_time_list(cJSON *element, T_EVENT *evt, int *id, t_processing_type processing_type, char *errmsg, size_t sz_errmsg) {
	memset(errmsg, 0, sz_errmsg);
	if ( !element) {
		snprintf(errmsg, sz_errmsg, "missing parameter 'element'");
		return ESP_FAIL;
	}
	cJSON *found = NULL;
	char *attr = NULL;
	switch(processing_type){
		case PT_INIT:
			attr="init";
			break;
		case PT_WORK:
			attr="work";
			break;
		case PT_FINAL:
			attr="final";
			break;
		default:
			break;
	}
    found = cJSON_GetObjectItemCaseSensitive(element, attr);
    if ( !found) {
    	// its ok if there are no items
		snprintf(errmsg, sz_errmsg, "id=%s:  missing '%s', no timing events", evt->oid, attr);
		return ESP_OK;
    }

