ankrysm/esp32_ws2812/main/create_events.c
	} while(false);

	if ( rc == ESP_OK) {
		snprintf(errmsg, sz_errmsg,"ok");
		object_list_add(obj);
		ESP_LOGI(__func__, "object '%s' added to list", obj->oid);
	} else {
		if ( obj) {
			ESP_LOGI(__func__, "object '%s' not valid, deleted", obj->oid);
			delete_object(obj);
		}
	}

	return rc;
}


/**
 * (1)
 * "object" structure contains
 * - a list of
 *   - an oid and
 *   - a data list
 */
static esp_err_t decode_json4event_object_list(cJSON *element, bool overwrite, char *errmsg, size_t sz_errmsg) {
	memset(errmsg, 0, sz_errmsg);
	if ( !element) {
		snprintf(errmsg, sz_errmsg, "missing parameter 'element'");
		return ESP_FAIL;
	}
	cJSON *found = NULL;
	char *attr = "objects";
    found = cJSON_GetObjectItemCaseSensitive(element, attr);
    if ( !found) {
		snprintf(errmsg, sz_errmsg, "missing attribute '%s'", attr);
		return ESP_ERR_NOT_FOUND;
    }

    if (!cJSON_IsArray(found)) {
		snprintf(errmsg, sz_errmsg, "attribute '%s' is not an array", attr);
		return ESP_FAIL;
    }

	int array_size = cJSON_GetArraySize(found);
	ESP_LOGI(__func__, "size of '%s'=%d", attr, array_size);
	if (array_size == 0) {
		snprintf(errmsg, sz_errmsg, "array '%s' has no content", attr);
		return ESP_ERR_NOT_FOUND;
	}

	esp_err_t rc = ESP_OK;
	for (int i=0; i < array_size; i++) {
		cJSON *element = cJSON_GetArrayItem(found, i);
		//JSON_Print(element);
		char l_errmsg[64];
		if (decode_json4event_object(element, overwrite, l_errmsg, sizeof(l_errmsg)) != ESP_OK) {
			snprintf(&(errmsg[strlen(errmsg)]), sz_errmsg - strlen(errmsg),"[%s]", l_errmsg);
			rc = ESP_FAIL;
		}
	}

	if ( rc == ESP_OK) {
		snprintf(errmsg, sz_errmsg,"ok");
	}

	return rc;

}


static esp_err_t decode_json4event_event(cJSON *element, bool overwrite, char *errmsg, size_t sz_errmsg) {
	if ( !cJSON_IsObject(element)) {
		snprintf(errmsg, sz_errmsg, "element is not an object");
		return ESP_FAIL;
	}

	char *attr;
	//double val;
	char sval[64];
	//bool bval;
	//int id = -1;
	esp_err_t lrc, rc = ESP_FAIL;
	T_EVENT *evt = NULL;

	memset(sval, 0, sizeof(sval));
	do {
		attr="id";
		if ((lrc=evt_get_string(element, attr, sval, sizeof(sval), errmsg, sz_errmsg) == RES_OK)) {
			//id = val;
			ESP_LOGI(__func__, "id=%s: by json", sval);
			T_EVENT *t = find_event(sval);
			if ( t ) {
				if ( overwrite ) {
					ESP_LOGI(__func__, "id='%s': event already exists, will be deleted", sval);
					lrc = delete_event_by_id(sval);
					if ( lrc != ESP_OK) {
						snprintf(errmsg, sz_errmsg, "event with id '%s' already exists, delete failed rc=%d", sval, lrc);
						break;
					}

				} else {
					snprintf(errmsg, sz_errmsg, "event with id '%s' already exists", sval);
					break;
				}
			} else {
				ESP_LOGI(__func__, "id='%s': doesn't exist", sval);
			}
		} else if (lrc==ESP_ERR_NOT_FOUND) {
			// calculate a new one
			get_new_event_id(sval, sizeof(sval));
			ESP_LOGI(__func__, "id='%s': auton´matically created", sval);
		} else {
			break; // error
		}
		if ( !(evt = create_event(sval)))
			break;
		ESP_LOGI(__func__, "id='%s': event created", evt->oid);

//		attr="pos";
//		if (evt_get_number(element, attr, &val, errmsg, sz_errmsg) == ESP_OK) {
//			evt->pos = val;
//			ESP_LOGI(__func__, "id=%d: %s=%.2f", id, attr, evt->pos);
//		}

//		attr="len_factor"; // optional, default 1.0
//		evt->len_factor = 1.0;
//		if (evt_get_number(element, attr, &val, errmsg, sz_errmsg) == ESP_OK) {
//			evt->len_factor = val;
//			ESP_LOGI(__func__, "id=%d: %s=%.2f", id, attr, evt->len_factor);
//		}

//		attr="len_factor_delta"; // optional default 0.0
//		evt->len_factor_delta = 0.0;
//		if (evt_get_number(element, attr, &val, errmsg, sz_errmsg) == ESP_OK) {
//			evt->len_factor_delta = val;
//			ESP_LOGI(__func__, "id=%d: %s=%.2f", id, attr, evt->len_factor_delta);
//		}

//		attr="speed"; // optional default 0.0
//		evt->speed = 0.0;
//		if (evt_get_number(element, attr, &val, errmsg, sz_errmsg) == ESP_OK) {
//			evt->speed = val;
//			ESP_LOGI(__func__, "id=%d: %s=%.2f", id, attr, evt->speed);
//		}

//		attr="acceleration"; // optional, default 0.0.
//		evt->acceleration = 0.0;
//		if (evt_get_number(element, attr, &val, errmsg, sz_errmsg) == ESP_OK) {
//			evt->acceleration = val;
//			ESP_LOGI(__func__, "id=%d: %s=%.2f", id, attr, evt->acceleration);
//		}

//		attr="brightness";
//		if (evt_get_number(element, attr, &val, errmsg, sz_errmsg) == ESP_OK) {
//			evt->brightness = val;
//			ESP_LOGI(__func__, "id=%d: %s=%.2f", id, attr, evt->brightness);
//		}

//		attr="brightness_delta";
//		if (evt_get_number(element, attr, &val, errmsg, sz_errmsg) == ESP_OK) {
//			evt->brightness_delta = val;
//			ESP_LOGI(__func__, "id=%d: %s=%.2f", id, attr, evt->brightness_delta);
//		}

//		attr="repeats";
//		if (evt_get_number(element, attr, &val, errmsg, sz_errmsg) == ESP_OK) {
//			evt->evt_time_list_repeats = val;
//			ESP_LOGI(__func__, "id=%d: %s=%d", id, attr, evt->evt_time_list_repeats);
//		}

//		attr="oid";
//		if (evt_get_string(element, attr, sval, sizeof(sval), errmsg, sz_errmsg) == RES_OK) {
//			strlcpy(evt->object_oid, sval, LEN_EVT_MARKER);
//			ESP_LOGI(__func__, "id=%d: %s=%s", id, attr, evt->object_oid);
//		}

//		attr="start_with_wait";
//		if (evt_get_bool(element, attr, &bval, errmsg, sz_errmsg) == ESP_OK) {
//			if ( bval) {
//				evt->flags = EVFL_WAIT; // start with wait
//			}
//			ESP_LOGI(__func__, "id=%d: %s=0x%04x", id, attr, evt->flags);
//		}
		// what to do
//		if ( decode_json4event_what_list(element, evt, errmsg, sz_errmsg) != ESP_OK )
//			break; // no list or decode error
//		ESP_LOGI(__func__,"id=%d: what list created", evt->id);

		int id=0;
		// to do for init (before run)
		if ( decode_json4event_evt_time_list(element, evt, &id, PT_INIT, errmsg, sz_errmsg) != ESP_OK )
			break; // no list or decode error
		ESP_LOGI(__func__,"id='%s': evt_time list INIT created (%s)", evt->oid, errmsg);

		// when to do
		if ( decode_json4event_evt_time_list(element, evt, &id, PT_WORK, errmsg, sz_errmsg) != ESP_OK )
			break; // no list or decode error
		ESP_LOGI(__func__,"id='%s': evt_time list WORK created (%s)", evt->oid, errmsg);

		if ( decode_json4event_evt_time_list(element, evt, &id, PT_FINAL, errmsg, sz_errmsg) != ESP_OK )
			break; // no list or decode error
		ESP_LOGI(__func__,"id='%s': evt_time list WORK created (%s)", evt->oid, errmsg);

		rc = ESP_OK;
	} while (0);

