ankrysm/esp32_ws2812/main/create_events.c
	if ( rc == ESP_OK) {
		snprintf(errmsg, sz_errmsg,"event %d created");
		ESP_LOGI(__func__,"id='%s': %s", evt->oid, errmsg);
		event_list_add(evt);
	} else {
		ESP_LOGE(__func__, "id='%s': error: %s", sval, errmsg);
		// delete created data
		delete_event(evt);
	}

	return rc;
}

static esp_err_t decode_json4event_event_list(cJSON *element, bool overwrite, char *errmsg, size_t sz_errmsg) {
	memset(errmsg, 0, sz_errmsg);
	if ( !element) {
		snprintf(errmsg, sz_errmsg, "missing parameter 'element'");
		return ESP_FAIL;
	}
	cJSON *found = NULL;
	char *attr = "events";
    found = cJSON_GetObjectItemCaseSensitive(element, attr);
    if ( !found) {
		snprintf(errmsg, sz_errmsg, "missing attribute '%s'", attr);
		return ESP_ERR_NOT_FOUND;
    }

    if (!cJSON_IsArray(found)) {
		snprintf(errmsg, sz_errmsg, "attribute '%s' is not an array", attr);
		return ESP_FAIL;
    }

	int array_size = cJSON_GetArraySize(found);
	ESP_LOGI(__func__, "size of '%s'=%d", attr, array_size);
	if (array_size == 0) {
		snprintf(errmsg, sz_errmsg, "array '%s' has no content", attr);
		return ESP_ERR_NOT_FOUND;
	}

	esp_err_t rc = ESP_OK;
	for (int i=0; i < array_size; i++) {
		cJSON *element = cJSON_GetArrayItem(found, i);
		//JSON_Print(element);
		char l_errmsg[64];
		if (decode_json4event_event(element, overwrite, l_errmsg, sizeof(l_errmsg)) != ESP_OK) {
			snprintf(&(errmsg[strlen(errmsg)]), sz_errmsg - strlen(errmsg),"[%s]", l_errmsg);
			rc = ESP_FAIL;
		}
	}

	if ( rc == ESP_OK) {
		snprintf(errmsg, sz_errmsg,"ok");
	}

	return rc;

}


/**
 * (0)
 */
esp_err_t decode_json4event(char *content, bool overwrite, char *errmsg, size_t sz_errmsg) {
	cJSON *tree = NULL;
	esp_err_t rc = ESP_FAIL;

	ESP_LOGI(__func__, "content='%s'", content);
	memset(errmsg, 0, sz_errmsg);

	do {
		tree = cJSON_Parse(content);
		if ( !tree) {
			snprintf(errmsg, sz_errmsg, "could not decode JSON-Data");
			break;
		}

		//JSON_Print(tree);

		if ( decode_json4event_object_list(tree, overwrite, errmsg, sz_errmsg) != ESP_OK )
			break; // no list or decode error
		ESP_LOGI(__func__,"object list created");


		if ( decode_json4event_event_list(tree, overwrite, errmsg, sz_errmsg) != ESP_OK )
			break; // no list or decode error
		ESP_LOGI(__func__,"event list created");
		rc = ESP_OK;

	} while(false);

	if ( tree)
		cJSON_Delete(tree);

	ESP_LOGI(__func__, "done: %s", errmsg);
	return rc;
}
